app/Controllers/AdminController.php

    public function orderList()
    {
        {
            $ordersModel = new OrdersModel();

            // Ambil semua data pesanan
            $orders = $ordersModel->findAll();
---
SELECT *
FROM `orders`

    public function orderDetail($id)
        {
            {
                $ordersModel = new OrdersModel();
                $ordersDetailModel = new OrdersDetailModel();
                $ordersConfirmModel = new OrdersConfirmModel();

                // Ambil data order berdasarkan ID
                $order = $ordersModel->find($id);

                // Cek jika order tidak ditemukan
                if (!$order) {
                    return redirect()->to('/admin/orders')->with('error', 'Order tidak ditemukan.');
                }

                // Ambil detail produk dari order
                $orderDetails = $ordersDetailModel->getOrderDetailsWithProduct($id);

                // Ambil informasi konfirmasi pembayaran jika ada
                $orderConfirm = $ordersConfirmModel->where('id_orders', $id)->first();
---
SELECT *
FROM `orders`
WHERE `orders`.`id` = '21'
SELECT *
FROM `orders_confirm`
WHERE `id_orders` = '21'
 LIMIT 1

    public function panel()
    {
        $categoryModel = new CategoryModel();
        $productModel = new ProductModel();
        $userModel = new UserModel();

        $data['categories'] = $categoryModel->findAll();
        $data['products'] = $productModel->getProductsWithCategory();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `category`
SELECT *
FROM `user`