app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `name` = 'admin'
 LIMIT 1
---
    public function loginPost()
    {
        //buat session
        $session = session();
        $model = new UserModel();
        //ambil data input user dan masukin variable
        $name = $this->request->getVar('name');
        $password = $this->request->getVar('password');
        //ini buat remember me
        $remember = $this->request->getVar('remember');

        //variabel buat ambil data dr model yg udah ada
        $user = $model->where('name', $name)->first();