app/Controllers/CartController.php

SELECT *
FROM `cart`
WHERE `id_user` = '5'
SELECT *
FROM `product`
WHERE `product`.`id` = '53'
---
    public function index()
    {
        $cartModel = new CartModel();
        $cartModel = new \App\Models\CartModel();
        $productModel = new \App\Models\ProductModel();
        $session = session();

        $id_user = $session->get('user_id');

        // Ambil data cart berdasarkan ID user
        $cartItems = $cartModel->where('id_user', $id_user)->findAll();

        $total = 0;
        foreach ($cartItems as &$item) {
            $product = $productModel->find($item['id_product']);

SELECT *
FROM `cart`
WHERE `id_user` = '7'
SELECT *
FROM `product`
WHERE `product`.`id` = '104'
---
    public function checkout()
    {
        $cartModel = new CartModel();
        $productModel = new ProductModel();
        $session = session();

        // Ambil ID user dari session
        $id_user = $session->get('user_id');

        // Ambil item keranjang milik user
        $cartItems = $cartModel->where('id_user', $id_user)->findAll();

        $total = 0;
        foreach ($cartItems as &$item) {
            $product = $productModel->find($item['id_product']);