app/Controllers/CategoryController.php

SELECT *
FROM `category`
WHERE `category`.`id` = '17'
---
    public function categoryForm($id = null)
    {
        $model = new CategoryModel();
        $data = [];

        if ($id) {
            // Ambil data kategori berdasarkan ID untuk mode edit
            $data['category'] = $model->find($id);