app/Controllers/Home.php

    public function index(): string
    {
                // Mulai session
                $session = session();
                $categoryModel = new CategoryModel();
                $productModel = new ProductModel();
                $data['categories'] = $categoryModel->findAll();
---
SELECT *
FROM `category`