app/Controllers/OrderController.php

SELECT *
FROM `orders`
WHERE `id_user` = '7'
ORDER BY `date` DESC
---
    public function index()
    {
        $ordersModel = new OrdersModel();
        $session = session();

        // Ambil ID user dari sesi
        $id_user = $session->get('user_id');

        // Ambil data orders berdasarkan ID user
        $orders = $ordersModel->where('id_user', $id_user)->orderBy('date', 'DESC')->findAll();