app/Controllers/ProductController.php

SELECT *
FROM `category`
---
    public function userProductForm($id = null)
    {
        $data['categories'] = $this->categoryModel->findAll();

INSERT INTO `product` (`id_category`, `title`, `desc`, `price`, `is_available`, `slug`, `image`, `id_user`, `created_at`, `updated_at`) VALUES ('18', 'konci motor', 'kunci', '5000', 1, 'konci-motor', '1733045598_c271930b623319f1cd2f.webp', '8', '2024-12-01 09:33:18', '2024-12-01 09:33:18')
---
    public function userSave()
    {
        $file = $this->request->getFile('image');
        $imageName = $file->isValid() ? $file->getRandomName() : '';

        if ($imageName) {
            $file->move('uploads', $imageName);
        }
        $id = $this->request->getPost('id');
        $productData = [
            'id_category' => $this->request->getPost('category'),
            'title' => $this->request->getPost('productName'),
            'desc' => $this->request->getPost('desc'),
            'price' => $this->request->getPost('price'),
            'is_available' => $this->request->getPost('stock') === 'available' ? 1 : 0,
            'slug' => $this->request->getPost('slug'),
            'image' => $imageName ?: $this->request->getPost('current_image'),
            'id_user' => session()->get('user_id'), // Pastikan ID user tersimpan
        ];
        if ($id) {
            // Periksa apakah produk milik user sebelum update
            $product = $this->productModel->where('id', $id)
                                        ->where('id_user', session()->get('user_id'))
                                        ->first();
            if (!$product) {
                return redirect()->to('/products')->with('error', 'Anda tidak memiliki izin untuk memperbarui produk ini.');
            }
            $this->productModel->update($id, $productData);
        } else {
            $this->productModel->insert($productData);

SELECT COUNT(*) AS `numrows`
FROM `orders_detail`
JOIN `orders` ON `orders`.`id` = `orders_detail`.`id_orders`
WHERE `orders_detail`.`id_product` = '105'
AND `orders`.`id_user` = '7'
---
    public function display($categorySlug, $productSlug)
    {
        $productModel = new ProductModel();
        $ordersDetailModel = new OrdersDetailModel();
        $commentsModel = new CommentsModel();
        $product = $productModel->getProductBySlugs($categorySlug, $productSlug);
        if (!$product) {
            return redirect()->to('/')->with('error', 'Produk tidak ditemukan.');
        }

        $comments = $commentsModel->getCommentsByProduct($product['id']);

        // Jika produk tidak ditemukan
        if (!$product) {
            return redirect()->to('/')->with('error', 'Produk tidak ditemukan.');
        }

        $isPurchased = false;
        if (session()->has('user_id')) {
            $userId = session('user_id');
            $isPurchased = $ordersDetailModel->join('orders', 'orders.id = orders_detail.id_orders')
                                             ->where('orders_detail.id_product', $product['id'])
                                             ->where('orders.id_user', $userId)
                                             ->countAllResults() > 0;

INSERT INTO `comments` (`id_product`, `id_user`, `comment`, `created_at`, `updated_at`) VALUES ('104', '7', 'wow', '2024-12-01 10:01:09', '2024-12-01 10:01:09')
---
    public function addComment()
    {
        $commentsModel = new CommentsModel();

        $userId = session('user_id');
        $productId = $this->request->getPost('id_product');
        $comment = $this->request->getPost('comment');

        // Validasi input
        if (!$userId || !$productId || !$comment) {
            return redirect()->back()->with('error', 'Komentar tidak valid.');
        }

        // Simpan komentar
        $commentsModel->insert([
            'id_product' => $productId,
            'id_user' => $userId,
            'comment' => $comment,
        ]);

SELECT *
FROM `category`
SELECT *
FROM `product`
WHERE `product`.`id` = '53'
---
    public function productForm($id = null)
    {
        $data['categories'] = $this->categoryModel->findAll();
        $data['product'] = $id ? $this->productModel->find($id) : null;