app/Controllers/UserController.php

SELECT *
FROM `user`
WHERE `user`.`id` = '7'
---
    public function index()
    {
                // ambil ID pengguna yang sedang login dari session
                $userId = session()->get('user_id');

                // load model user dan ambil data pengguna berdasarkan ID
                $userModel = new UserModel();
                $data['user'] = $userModel->find($userId);

SELECT *
FROM `user`
WHERE `user`.`id` = '7'
---
    public function edit()
    {
        // cuman yg login yg bisa edit profil
        $userId = session()->get('user_id');
        $userModel = new UserModel();

        $data['user'] = $userModel->find($userId);

SELECT *
FROM `user`
WHERE `user`.`id` = '5'
---
    public function userForm($id = null)
    {
        $data['user'] = $id ? $this->userModel->find($id) : null;