app/Models/CommentsModel.php

    public function getCommentsByProduct($productId)
    {
        return $this->select('comments.*, user.name as user_name')
                    ->join('user', 'user.id = comments.id_user')
                    ->where('comments.id_product', $productId)
                    ->orderBy('comments.created_at', 'DESC')
                    ->findAll();
---
SELECT `comments`.*, `user`.`name` as `user_name`
FROM `comments`
JOIN `user` ON `user`.`id` = `comments`.`id_user`
WHERE `comments`.`id_product` = '105'
ORDER BY `comments`.`created_at` DESC