app/Models/OrdersDetailModel.php

    public function getUserProductSales($userId)
    {
        return $this->select('product.title, SUM(orders_detail.qty) as total_sold')
                    ->join('product', 'product.id = orders_detail.id_product')
                    ->where('product.id_user', $userId)
                    ->groupBy('orders_detail.id_product')
                    ->findAll();
---
SELECT `product`.`title`, SUM(orders_detail.qty) as total_sold
FROM `orders_detail`
JOIN `product` ON `product`.`id` = `orders_detail`.`id_product`
WHERE `product`.`id_user` = '8'
GROUP BY `orders_detail`.`id_product`

    public function getOrderDetailsWithProduct($orderId)
    {
        return $this->select('orders_detail.*, product.title as product_name')
                    ->join('product', 'product.id = orders_detail.id_product')
                    ->where('orders_detail.id_orders', $orderId)
                    ->findAll();
---
SELECT `orders_detail`.*, `product`.`title` as `product_name`
FROM `orders_detail`
JOIN `product` ON `product`.`id` = `orders_detail`.`id_product`
WHERE `orders_detail`.`id_orders` = '21'