app/Models/ProductModel.php

    public function getProductsWithCategory()
    {
        return $this->select('product.*, category.title as category_title')
                    ->join('category', 'category.id = product.id_category')
                    ->findAll();
---
SELECT `product`.*, `category`.`title` as `category_title`
FROM `product`
JOIN `category` ON `category`.`id` = `product`.`id_category`

    public function getProductsWithCategoryAndUserAndSlugs()
    {
        return $this->select('product.*, category.title as category_title, user.name as user_name, category.slug as category_slug')
                    ->join('category', 'category.id = product.id_category')
                    ->join('user', 'user.id = product.id_user')
                    ->findAll();
---
SELECT `product`.*, `category`.`title` as `category_title`, `user`.`name` as `user_name`, `category`.`slug` as `category_slug`
FROM `product`
JOIN `category` ON `category`.`id` = `product`.`id_category`
JOIN `user` ON `user`.`id` = `product`.`id_user`

    public function getProductBySlugs($categorySlug, $productSlug)
    {
        return $this->select('product.*, category.title as category_title, category.slug as category_slug, user.name as user_name')
                    ->join('category', 'category.id = product.id_category')
                    ->join('user', 'user.id = product.id_user')
                    ->where('category.slug', $categorySlug)
                    ->where('product.slug', $productSlug)
                    ->first();
---
SELECT `product`.*, `category`.`title` as `category_title`, `category`.`slug` as `category_slug`, `user`.`name` as `user_name`
FROM `product`
JOIN `category` ON `category`.`id` = `product`.`id_category`
JOIN `user` ON `user`.`id` = `product`.`id_user`
WHERE `category`.`slug` = 'merchandise-gaming'
AND `product`.`slug` = 'kaos-kaki-gaming'
 LIMIT 1